src/posts/ReadAlong_TCOEDS.org
#+TITLE: Read Along: Time, Clocks, and the Ordering of Events in a Distributed System

In my first few months at Amazon, I needed (or at least thought I
needed) to synchronize writes to a Dynamo table. My deskmate and I
started diagramming an implementation for a naive distributed
locking-mechanism. A recent grad school graduate, overhearing our
conversation [fn:1] interrupted and said, "Oh, there's like, a whole
paper about this stuff by a famous guy from Microsoft."

It took me a few years to get to it, but I finally read the famous
guy's paper, "Time, Clocks, and the Ordering of Events in a
Distributed System." Here's what I learned.

First, a couple of definitions.

- System :: a collection of processes
- Process :: a sequence of events
- Distributed System :: a collection of processes which exchange
     messages. The time it takes to transmit messages is
     non-negligible compared to the time between events.

Crucially, Lamport's definition of a distributed system is based on
the transmission delay associated with sending a message, but it
doesn't address the reliability of the transmission medium.

Also, note that nothing about this definition restricts it to a
collection of computers. A distributed system could just as easily be
comprised of the individual components of a single computer or two
army generals standing on distant hilltops.

The first half of the paper describes a system that imposes a total
ordering on all events. This system can produce unintuitive orderings
which don't correspond with the passage of time, so in the second half
of the paper Lamport extends this system to impose a total ordering of
events that incorporates events in physical space-time.

* Partial Ordering

Remember how the processes in a distributed system don't have to be
computers? Let's make our processes people. Our messages aren't
encrypted, so we'll dispense with Bob and Alice and call our processes
Bonesaw and Andromeda. Bonesaw and Andromeda are hip millenials who
communicate only via Snapchat.

Time to introduce our first relation: "happened-before," denoted
$\rightarrow$

The happened-before relation must satisfy three properties:

1. If events $a$ and $b$ belong to the same process, and $a$ comes
   before $b$, then $a \rightarrow b$.
2. If $a$ corresponds to the sending of a message by one process, and
   $b$ corresponds to the receipt of that message by another process,
   then $a \rightarrow b$.
3. The relation is transitive. That is, if $a \rightarrow b$ and $b
   \rightarrow c$ then $a \rightarrow c$.

We call $a$ and $b$ "concurrent" if $a \nrightarrow b$ and $b
\nrightarrow a$ - in other words, neither event happened first because
their relative ordering is indeterminate.

Another way to define the happened-before relation is to say that $a
\rightarrow b$ when it is possible that $a$ could have caused $b$. Two
events are concurrent if neither event could have possibly caused the
other.

Notice that physical time appears nowhere in these definitions.

* Logical Clocks

Now we're ready to bring in clocks. Unlike wall-clocks, which run
continuously, our logical clocks are discrete and event-driven. That
is, they only "tick" in response to events. Each process has its own
clock which assigns, to each of its events, an integer representing
the "time" at which the event occurred.

More formally, each process $P_i$ has an associated clock $C_i$,
defined as a function which assigns a number $C_i \langle a \rangle$
to event $a$ in process $P_i$. We define $C$ as the entire system of
clocks which assigns to any event $b$ the number $C \langle b
\rangle$, such that $C \langle b \rangle = C_j \langle b \rangle$ if
$b$ is an event in process $P_j$.

For our clocks to be useful, they should ensure that if $a$ happens
before $b$, then $a$ happens at an earlier time than $b$. This is
called the Clock Condition.

Formally, it states that:

#+NAME: ClockCondition
\begin{equation}
   \text{For any events } a, b, \text{if } a \rightarrow b \text{ then } C \langle a \rangle < C \langle b \rangle.
\end{equation}

Lamport claims that "it is easy to see" that the converse does not
hold. It wasn't easy for me, so I attempted an informal proof, which you can
check [[*Proof%20that%20converse%20of%20Clock%20Condition%20does%20not%20hold][here]] if you care to.

Applying the definition of the happened-before relation, we can
restate the Clock Condition in the form of the following two
conditions.

- C1 :: If $a$ and $b$ are events in process $P_i$, and $a$ comes
     before $b$, then $C_i \langle a \rangle < C_i \langle b \rangle$.
- C2 :: If $a$ is the sending of a message by process $P_i$ and $b$ is
     the receipt of the message by process $P_j$, then $C_i \langle a
     \rangle < C_j \langle b \rangle$.

It's easy to define an algorithm that satisfies both conditions. We
need only two implementation rules.

- IR1 :: Each process increments its clock after each event.
         (Satisfies C1)
- IR2 :: Every process timestamps outbound messages with its current
         clock value. The receiving process sets its clock forward if
         necessary to ensure that its clock value is greater than the
         timestamp in the message. (Satisfies C2)

The only downside of this approach is that still imposes only a
partial ordering. For concurrent events the ordering is stil
non-deterministic. The remedy is simple: just arbitrarily define a
total ordering on the processes.

Under this scheme, if Bonesaw and Andromeda send concurrent messages,
a total ordering in which Andromeda $<$ Bonesaw would dictate that we
always order Andromeda's message before Bonesaw's (Sorry, Bonesaw).

And that's it. We now have a system of logical clocks which imposes a
total ordering on events. Why is this useful? Because we can use it as
the basis for a mutual exclusion mechanism. That is, we can implement
a (still extremely naive) distributed lock using our logical clocks.

In fact, let's go ahead and do that.

* Implementation
:PROPERTIES:
:header-args: :tangle code/tcoeds.py
:END:

#+BEGIN_SRC emacs-lisp :tangle no :exports none
(setq org-src-preserve-indentation t)
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC python :exports none :shebang #!/usr/bin/python2.7

from random import randint
import logging
#+END_SRC


