posts/ReadAlong_TCOEDS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-01-22 Sun 21:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Andrew Stahlman" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb2b3ba9">1. Read Along: Time, Clocks, and the Ordering of Events in a Distributed System</a>
<ul>
<li><a href="#org57159ce">1.1. Partial Ordering</a></li>
<li><a href="#org6e242d9">1.2. Logical Clocks</a></li>
<li><a href="#org80b278f">1.3. Implementation</a></li>
<li><a href="#org768abf4">1.4. Appendix</a>
<ul>
<li><a href="#org2f3d0f3">1.4.1. Proof that converse of Clock Condition does not hold</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb2b3ba9" class="outline-2">
<h2 id="orgb2b3ba9"><span class="section-number-2">1</span> Read Along: Time, Clocks, and the Ordering of Events in a Distributed System</h2>
<div class="outline-text-2" id="text-1">
<p>
In my first few months at Amazon, I needed (or at least thought I
needed) to synchronize writes to a Dynamo table. My deskmate and I
started diagramming an implementation for a naive distributed
locking-mechanism. A recent grad school graduate, overhearing our
conversation <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> interrupted and said, "Oh, there's like, a whole
paper about this stuff by a famous guy from Microsoft."
</p>

<p>
It took me a few years to get to it, but I finally read the famous
guy's paper, "Time, Clocks, and the Ordering of Events in a
Distributed System." Here's what I learned.
</p>

<p>
First, a couple of definitions.
</p>

<dl class="org-dl">
<dt>System</dt><dd>a collection of processes</dd>
<dt>Process</dt><dd>a sequence of events</dd>
<dt>Distributed System</dt><dd>a collection of processes which exchange
messages. The time it takes to transmit messages is
non-negligible compared to the time between events.</dd>
</dl>

<p>
Crucially, Lamport's definition of a distributed system is based on
the transmission delay associated with sending a message, but it
doesn't address the reliability of the transmission medium.
</p>

<p>
Also, note that nothing about this definition restricts it to a
collection of computers. A distributed system could just as easily be
comprised of the individual components of a single computer or two
army generals standing on distant hilltops.
</p>

<p>
The first half of the paper describes a system that imposes a total
ordering on all events. This system can produce unintuitive orderings
which don't correspond with the passage of time, so in the second half
of the paper Lamport extends this system to impose a total ordering of
events that incorporates events in physical space-time.
</p>
</div>

<div id="outline-container-org57159ce" class="outline-3">
<h3 id="org57159ce"><span class="section-number-3">1.1</span> Partial Ordering</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Remember how the processes in a distributed system don't have to be
computers? Let's make our processes people. Our messages aren't
encrypted, so we'll dispense with Bob and Alice and call our processes
Bonesaw and Andromeda. Bonesaw and Andromeda are hip millenials who
communicate only via Snapchat.
</p>

<p>
Time to introduce our first relation: "happened-before," denoted
\(\rightarrow\)
</p>

<p>
The happened-before relation must satisfy three properties:
</p>

<ol class="org-ol">
<li>If events \(a\) and \(b\) belong to the same process, and \(a\) comes
before \(b\), then \(a \rightarrow b\).</li>
<li>If \(a\) corresponds to the sending of a message by one process, and
\(b\) corresponds to the receipt of that message by another process,
then \(a \rightarrow b\).</li>
<li>The relation is transitive. That is, if \(a \rightarrow b\) and \(b
   \rightarrow c\) then \(a \rightarrow c\).</li>
</ol>

<p>
We call \(a\) and \(b\) "concurrent" if \(a \nrightarrow b\) and \(b
\nrightarrow a\) - in other words, neither event happened first because
their relative ordering is indeterminate.
</p>

<p>
Another way to define the happened-before relation is to say that \(a
\rightarrow b\) when it is possible that \(a\) could have caused \(b\). Two
events are concurrent if neither event could have possibly caused the
other.
</p>

<p>
Notice that physical time appears nowhere in these definitions.
</p>
</div>
</div>

<div id="outline-container-org6e242d9" class="outline-3">
<h3 id="org6e242d9"><span class="section-number-3">1.2</span> Logical Clocks</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Now we're ready to bring in clocks. Unlike wall-clocks, which run
continuously, our logical clocks are discrete and event-driven. That
is, they only "tick" in response to events. Each process has its own
clock which assigns, to each of its events, an integer representing
the "time" at which the event occurred.
</p>

<p>
More formally, each process \(P_i\) has an associated clock \(C_i\),
defined as a function which assigns a number \(C_i \langle a \rangle\)
to event \(a\) in process \(P_i\). We define \(C\) as the entire system of
clocks which assigns to any event \(b\) the number \(C \langle b
\rangle\), such that \(C \langle b \rangle = C_j \langle b \rangle\) if
\(b\) is an event in process \(P_j\).
</p>

<p>
For our clocks to be useful, they should ensure that if \(a\) happens
before \(b\), then \(a\) happens at an earlier time than \(b\). This is
called the Clock Condition.
</p>

<p>
Formally, it states that:
</p>

\begin{equation}
   \text{For any events } a, b, \text{if } a \rightarrow b \text{ then } C \langle a \rangle < C \langle b \rangle.
\end{equation}

<p>
Lamport claims that "it is easy to see" that the converse does not
hold. It wasn't easy for me, so I attempted an informal proof, which you can
check <a href="#org2f3d0f3">here</a> if you care to.
</p>

<p>
Applying the definition of the happened-before relation, we can
restate the Clock Condition in the form of the following two
conditions.
</p>

<dl class="org-dl">
<dt>C1</dt><dd>If \(a\) and \(b\) are events in process \(P_i\), and \(a\) comes
before \(b\), then \(C_i \langle a \rangle < C_i \langle b \rangle\).</dd>
<dt>C2</dt><dd>If \(a\) is the sending of a message by process \(P_i\) and \(b\) is
the receipt of the message by process \(P_j\), then \(C_i \langle a
     \rangle < C_j \langle b \rangle\).</dd>
</dl>

<p>
It's easy to define an algorithm that satisfies both conditions. We
need only two implementation rules.
</p>

<dl class="org-dl">
<dt>IR1</dt><dd>Each process increments its clock after each event.
(Satisfies C1)</dd>
<dt>IR2</dt><dd>Every process timestamps outbound messages with its current
clock value. The receiving process sets its clock forward if
necessary to ensure that its clock value is greater than the
timestamp in the message. (Satisfies C2)</dd>
</dl>

<p>
The only downside of this approach is that still imposes only a
partial ordering. For concurrent events the ordering is stil
non-deterministic. The remedy is simple: just arbitrarily define a
total ordering on the processes.
</p>

<p>
Under this scheme, if Bonesaw and Andromeda send concurrent messages,
a total ordering in which Andromeda \(<\) Bonesaw would dictate that we
always order Andromeda's message before Bonesaw's (Sorry, Bonesaw).
</p>

<p>
And that's it. We now have a system of logical clocks which imposes a
total ordering on events. Why is this useful? Because we can use it as
the basis for a mutual exclusion mechanism. That is, we can implement
a (still extremely naive) distributed lock using our logical clocks.
</p>

<p>
In fact, let's go ahead and do that.
</p>
</div>
</div>
