src/posts/ReadAlong_TCOEDS.org
** LogicalClock

A LogicalClock keeps track of the current time in a Process. The clock
can tick in two ways:

- increment :: in which the time increases by 1 (i.e., a tick)
- ensure_at_least :: fast-forward if necessary to ensure the clock is
     set to at least the given time

The former is used upon sending a message (IR1). The latter is used
upon receiving a message (IR2).

#+begin_src python
class LogicalClock(object):

    def __init__(self):
        self.time = 0

    def increment(self):
        self.time += 1

    def ensure_at_least(self, t):
        self.time = max(self.time, t)
#+end_src

** Mutex

A Mutex can have at most one owner at a given time. It tracks its
current owner and the number of times it has been claimed and
released, respectively.

#+begin_src python
class Mutex(object):

    def __init__(self):
        self._owner = None
        self.num_claims = 0
        self.num_releases = 0

    def owner(self):
        return self._owner
#+end_src

We fail loudly if a Process attempts to claim the lock while it is
owned by another Process. We also perform a sanity check that each
claim has had a corresponding release.

#+begin_src python
    def claim(self, new_owner):
        assert self._owner is None, "Aaaaaaaaaaaagh. {} tried to claim the lock, but {} owns it.".format(new_owner, self._owner)
        logging.debug("{} claims the lock.".format(new_owner))
        self._owner = new_owner
        self.num_claims += 1
        assert self.num_claims == self.num_releases + 1
#+end_src

We also fail loudly if any Process other than the lock's owner
attempts to release it. Upon release, we again assert that every claim
has a corresponding release.

#+begin_src python
    def release(self, owner):
        assert self._owner is owner, "{} tried to release a lock that {} owns.".format(owner, self._owner)
        logging.debug("{} releases the lock.".format(owner))
        self._owner = None
        self.num_releases += 1
        assert self.num_claims == self.num_releases
#+end_src

** Message

A Message has three components: a sender, a recipient, and a
timestamp. The timestamp is the local time at which the message was
sent from the perspective of the sending Process.

#+begin_src python
class Message(object):

    def __init__(self, sender, recipient, sent_at):
        self.sender = sender
        self.recipient = recipient
        self.sent_at = sent_at

    def __repr__(self):
        return "{}@{} -> {}: {}".format(self.sender.name, self.sent_at, self.recipient.name, self.content)
#+end_src

There are three classes of Messages: a Request for the mutex, a
Release of the mutex, and an Acknowledgement of a Request by another
Process.

#+begin_src python
    @classmethod
    def a_mutex_request(cls, sender, recipient, sent_at):
        m = Message(sender, recipient, sent_at)
        m.content = "REQUEST"
        return m

    @classmethod
    def a_mutex_release(cls, sender, recipient, sent_at):
        m = Message(sender, recipient, sent_at)
        m.content = "RELEASE"
        return m

    @classmethod
    def an_ack(cls, sender, recipient, sent_at):
        m = Message(sender, recipient, sent_at)
        m.content = "ACK"
        return m
#+end_src

