posts/ReadAlong_TCOEDS.html

<div id="outline-container-org80b278f" class="outline-3">
<h3 id="org80b278f"><span class="section-number-3">1.3</span> Implementation</h3>
<div class="outline-text-3" id="text-1-3">
<p>
A LogicalClock keeps track of the current time in a Process. The clock
can tick in two ways:
</p>

<dl class="org-dl">
<dt>increment</dt><dd>in which the time increases by 1 (i.e., a tick)</dd>
<dt>ensure<sub>at</sub><sub>least</sub></dt><dd>fast-forward if necessary to ensure the clock is
set to at least the given time</dd>
</dl>

<p>
The former is used upon sending a message (IR1). The latter is used
upon receiving a message (IR2).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">class</span> <span style="color: #e7c547;">LogicalClock</span><span style="color: #c397d8;">(</span><span style="color: #70c0b1;">object</span><span style="color: #c397d8;">)</span>:

    <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">__init__</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>:
        <span style="color: #c397d8;">self</span>.time = 0

    <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">increment</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>:
        <span style="color: #c397d8;">self</span>.time += 1

    <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">ensure_at_least</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>, t<span style="color: #c397d8;">)</span>:
        <span style="color: #c397d8;">self</span>.time = <span style="color: #70c0b1;">max</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>.time, t<span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
A Mutex can have at most one owner at a given time. It tracks its
current owner and the number of times it has been claimed and
released, respectively.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">class</span> <span style="color: #e7c547;">Mutex</span><span style="color: #c397d8;">(</span><span style="color: #70c0b1;">object</span><span style="color: #c397d8;">)</span>:

    <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">__init__</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>:
        <span style="color: #c397d8;">self</span>._owner = <span style="color: #70c0b1;">None</span>
        <span style="color: #c397d8;">self</span>.num_claims = 0
        <span style="color: #c397d8;">self</span>.num_releases = 0

    <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">owner</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>:
        <span style="color: #c397d8;">return</span> <span style="color: #c397d8;">self</span>._owner
</pre>
</div>

<p>
We fail loudly if a Process attempts to claim the lock while it is
owned by another Process. We also perform a sanity check that each
claim has had a corresponding release.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">claim</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>, new_owner<span style="color: #c397d8;">)</span>:
    <span style="color: #c397d8;">assert</span> <span style="color: #c397d8;">self</span>._owner <span style="color: #c397d8;">is</span> <span style="color: #70c0b1;">None</span>, <span style="color: #b9ca4a;">"Aaaaaaaaaaaagh. {} tried to claim the lock, but {} owns it."</span>.<span style="color: #70c0b1;">format</span><span style="color: #c397d8;">(</span>new_owner, <span style="color: #c397d8;">self</span>._owner<span style="color: #c397d8;">)</span>
    logging.debug<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"{} claims the lock."</span>.<span style="color: #70c0b1;">format</span><span style="color: #7aa6da;">(</span>new_owner<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
    <span style="color: #c397d8;">self</span>._owner = new_owner
    <span style="color: #c397d8;">self</span>.num_claims += 1
    <span style="color: #c397d8;">assert</span> <span style="color: #c397d8;">self</span>.num_claims == <span style="color: #c397d8;">self</span>.num_releases + 1
</pre>
</div>

<p>
We also fail loudly if any Process other than the lock's owner
attempts to release it. Upon release, we again assert that every claim
has a corresponding release.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">release</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>, owner<span style="color: #c397d8;">)</span>:
    <span style="color: #c397d8;">assert</span> <span style="color: #c397d8;">self</span>._owner <span style="color: #c397d8;">is</span> owner, <span style="color: #b9ca4a;">"{} tried to release a lock that {} owns."</span>.<span style="color: #70c0b1;">format</span><span style="color: #c397d8;">(</span>owner, <span style="color: #c397d8;">self</span>._owner<span style="color: #c397d8;">)</span>
    logging.debug<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"{} releases the lock."</span>.<span style="color: #70c0b1;">format</span><span style="color: #7aa6da;">(</span>owner<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
    <span style="color: #c397d8;">self</span>._owner = <span style="color: #70c0b1;">None</span>
    <span style="color: #c397d8;">self</span>.num_releases += 1
    <span style="color: #c397d8;">assert</span> <span style="color: #c397d8;">self</span>.num_claims == <span style="color: #c397d8;">self</span>.num_releases
</pre>
</div>

<p>
A Message has three components: a sender, a recipient, and a
timestamp. The timestamp is the local time at which the message was
sent from the perspective of the sending Process.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">class</span> <span style="color: #e7c547;">Message</span><span style="color: #c397d8;">(</span><span style="color: #70c0b1;">object</span><span style="color: #c397d8;">)</span>:

    <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">__init__</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>, sender, recipient, sent_at<span style="color: #c397d8;">)</span>:
        <span style="color: #c397d8;">self</span>.sender = sender
        <span style="color: #c397d8;">self</span>.recipient = recipient
        <span style="color: #c397d8;">self</span>.sent_at = sent_at

    <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">__repr__</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>:
        <span style="color: #c397d8;">return</span> <span style="color: #b9ca4a;">"{}@{} -&gt; {}: {}"</span>.<span style="color: #70c0b1;">format</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>.sender.name, <span style="color: #c397d8;">self</span>.sent_at, <span style="color: #c397d8;">self</span>.recipient.name, <span style="color: #c397d8;">self</span>.content<span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
There are three classes of Messages: a Request for the mutex, a
Release of the mutex, and an acknowledgement of a Request by another
Process.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">@classmethod</span>
<span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">a_mutex_request</span><span style="color: #c397d8;">(</span>cls, sender, recipient, sent_at<span style="color: #c397d8;">)</span>:
    <span style="color: #e78c45;">m</span> = Message<span style="color: #c397d8;">(</span>sender, recipient, sent_at<span style="color: #c397d8;">)</span>
    <span style="color: #e78c45;">m.content</span> = <span style="color: #b9ca4a;">"REQUEST"</span>
    <span style="color: #c397d8;">return</span> m

<span style="color: #e7c547;">@classmethod</span>
<span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">a_mutex_release</span><span style="color: #c397d8;">(</span>cls, sender, recipient, sent_at<span style="color: #c397d8;">)</span>:
    <span style="color: #e78c45;">m</span> = Message<span style="color: #c397d8;">(</span>sender, recipient, sent_at<span style="color: #c397d8;">)</span>
    <span style="color: #e78c45;">m.content</span> = <span style="color: #b9ca4a;">"RELEASE"</span>
    <span style="color: #c397d8;">return</span> m

<span style="color: #e7c547;">@classmethod</span>
<span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">an_ack</span><span style="color: #c397d8;">(</span>cls, sender, recipient, sent_at<span style="color: #c397d8;">)</span>:
    <span style="color: #e78c45;">m</span> = Message<span style="color: #c397d8;">(</span>sender, recipient, sent_at<span style="color: #c397d8;">)</span>
    <span style="color: #e78c45;">m.content</span> = <span style="color: #b9ca4a;">"ACK"</span>
    <span style="color: #c397d8;">return</span> m
</pre>
</div>

<p>
