src/posts/ReadAlong_TCOEDS.org
** Message Broker

The MsgBroker mediates communication between Processes. A Process
sends messages by posting the message to the MsgBroker, which enqueues
the message for delivery.

#+begin_src python
class MsgBroker(object):

    def __init__(self):
        self.queue = {}

    def send_message(self, sender, recipient, msg):
        queue_key = (sender, recipient)
        outbox = self.queue.get(queue_key, [])
        self.queue[queue_key] = outbox
        outbox.append(msg)

#+end_src

We add a random delay to the delivery of messages to simulate network
latency. As Lamport points out, we are making the unrealistic
assumption that all messages from a particular process are not only
guaranteed to arrive, but are guaranteed to arrive in the same order
in which they were sent. In the real world we would use a protocol
that allows the receiver to detect when messages are lost or delivered
out of order.

#+begin_src python
    def deliver(self):
        for (sender, recipient), outbox in self.queue.items():
            while outbox and randint(1, 20) == 1:
                msg = outbox.pop(0)
                logging.debug("[MSG]: {}".format(msg))
                recipient.receive_message(sender, msg)
#+end_src

#+begin_src python :exports none
    def __str__(self):
        pending_msgs = 0
        for (sender, recipient), outbox in self.queue.items():
            pending_msgs += (len(outbox) if outbox else 0)
        return 'Messages pending delivery: {}'.format(pending_msgs)
#+end_src

