posts/ReadAlong_TCOEDS.html
The MsgBroker mediates communication between Processes. A Process
sends messages by posting the message to the MsgBroker, which enqueues
the message for delivery.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">class</span> <span style="color: #e7c547;">MsgBroker</span><span style="color: #c397d8;">(</span><span style="color: #70c0b1;">object</span><span style="color: #c397d8;">)</span>:

    <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">__init__</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>:
        <span style="color: #c397d8;">self</span>.queue = <span style="color: #c397d8;">{}</span>

    <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">send_message</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>, sender, recipient, msg<span style="color: #c397d8;">)</span>:
        <span style="color: #e78c45;">queue_key</span> = <span style="color: #c397d8;">(</span>sender, recipient<span style="color: #c397d8;">)</span>
        <span style="color: #e78c45;">outbox</span> = <span style="color: #c397d8;">self</span>.queue.get<span style="color: #c397d8;">(</span>queue_key, <span style="color: #7aa6da;">[]</span><span style="color: #c397d8;">)</span>
        <span style="color: #c397d8;">self</span>.queue<span style="color: #c397d8;">[</span>queue_key<span style="color: #c397d8;">]</span> = outbox
        outbox.append<span style="color: #c397d8;">(</span>msg<span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
We add a random delay to the delivery of messages to simulate network
latency. As Lamport points out, we are making the unrealistic
assumption that all messages from a particular process are not only
guaranteed to arrive, but are guaranteed to arrive in the same order
in which they were sent. In the real world we would use a protocol
that allows the receiver to detect when messages are lost or delivered
out of order.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">deliver</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>:
    <span style="color: #c397d8;">for</span> <span style="color: #c397d8;">(</span>sender, recipient<span style="color: #c397d8;">)</span>, outbox <span style="color: #c397d8;">in</span> <span style="color: #c397d8;">self</span>.queue.items<span style="color: #c397d8;">()</span>:
        <span style="color: #c397d8;">while</span> outbox <span style="color: #c397d8;">and</span> randint<span style="color: #c397d8;">(</span>1, 20<span style="color: #c397d8;">)</span> == 1:
            <span style="color: #e78c45;">msg</span> = outbox.pop<span style="color: #c397d8;">(</span>0<span style="color: #c397d8;">)</span>
            logging.debug<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"[MSG]: {}"</span>.<span style="color: #70c0b1;">format</span><span style="color: #7aa6da;">(</span>msg<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
            recipient.receive_message<span style="color: #c397d8;">(</span>sender, msg<span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
