src/posts/ReadAlong_TCOEDS.org
** Process

Each process is uniquely identified by a name. Processes coordinate
access to a shared resource via the_lock and communicate via a
msg_broker.

#+BEGIN_SRC python
class Process(object):

    def __init__(self, name, the_lock, msg_broker, num_peers):
        self.name = name
        self.the_lock = the_lock
        self.msg_broker = msg_broker
        self.num_peers = num_peers
#+END_SRC

Every process maintains its own logical clock. Every claim on the lock
is stored in the request queue. Upon receiving a message from another
process, we record the current time and associate it with the sender
of the message in the =latest_ack_from= dict. We will refer to this dict
to determine whether another process has acknowledged our request to
claim the lock.

#+BEGIN_SRC python
        self.clock = LogicalClock()
        self.request_queue = []
        self.latest_ack_from = {}
#+END_SRC

#+BEGIN_SRC python :exports none
    def __str__(self):
        return "{name}@{time}".format(name=self.name, time=self.time())
#+END_SRC

To request the lock we send a timestamped message to each of our peers.

#+BEGIN_SRC python
    def request_lock(self, peers):
        for p in peers:
            msg = Message.a_mutex_request(self, p, self.time())
            self.send_message(p, msg)
#+END_SRC

We also add the timestamped request to our own request queue. Then we
increment the clock. This clock tick corresponds to IR1, which
dictates that the clock be incremented between successive events.

#+BEGIN_SRC python
        self.request_queue.append(Message.a_mutex_request(self, self, self.time()))
        self.clock.increment()
#+END_SRC

A process issues a request for the lock about once every 10 cycles of
our simulation provided that it has no requests pending. We can run
the simulation under different degrees of lock contention by adjusting
the probability that the process "wants" the lock.

#+begin_src python
    def wants_lock(self):
        return not self.has_request_pending() and randint(1, 10) == 1

    def has_request_pending(self):
        return any(x for x in self.request_queue if x.sender is self)
#+end_src

If a process owns the lock, its request is guaranteed to be at the
front of the queue. Thus, to release the lock we pop the head of the
queue and notify the other processes. Sending these messages
corresponds to an event, so we increment the clock in accordance with
IR1.

#+BEGIN_SRC python
    def release_lock(self, peers):
        assert self.the_lock.owner() is self, "Tried to release a lock we don't own!"
        req = self.request_queue.pop(0)
        assert req.sender is self, "We somehow claimed the lock without being at the front of the queue!"
        self.the_lock.release(self)
        for p in peers:
            self.send_message(p, Message.a_mutex_release(self, p, self.time()))
        self.clock.increment()
#+end_src

We can adjust how long a process holds the lock here. Increasing the
expected lock hold time while holding constant the probability that a
process wants the lock will increase lock contention.

#+BEGIN_SRC python
    def ready_to_release(self):
        return randint(1, 2)
#+end_src

According to IR2, when a process receives a message it sets its clock
to a value greater than or equal to its present value and greater than
timestamp on the incoming message.

#+begin_src python
    def receive_message(self, sender, msg):
        self.clock.ensure_at_least(msg.sent_at + 1)
#+end_src

The first type of message we must handle is a request for the lock.
After we place the request on the request_queue, we send a timestamped
acknowledgement to the process that claimed the lock.

#+begin_src python
        if msg.content == "REQUEST":
            self.request_queue.append(msg)
            self.send_message(sender, Message.an_ack(self, sender, self.time()))
#+end_src

The second type of message is a release of the lock. The (now former)
owner of the lock is guaranteed to be at the head of the queue, so we
just pop the head of the queue.

#+begin_src python
        elif msg.content == "RELEASE":
            logging.debug("{} processing release by {}. Before removing:".format(self, sender))
            logging.debug(str(self.request_queue))
            self.request_queue.pop(0)
            logging.debug("After: {}:".format(self.request_queue))
#+end_src

The third and final type of message is an acknowledgement of our claim
from another process. In this case we simply record the time of the
acknowledgement and the process that sent it.

#+begin_src python
        elif msg.content == "ACK":
            self.latest_ack_from[sender.name] = msg.sent_at
#+end_src

We could potentially claim the lock in response to two types of
events: an acknowledgement of our claim (if no other process owns the
lock) or a notification of a release. When we receive either of these
messages, we check whether we have the right to claim the lock. If we
do, we take it.

#+begin_src python
        if msg.content in ["ACK", "RELEASE"] and self.can_claim_lock():
                self.the_lock.claim(self)
#+end_src

We can claim the lock if and only if the following two conditions
hold:

1. Our request for the lock is ordered before every other request.
2. We have received an acknowledgement of our claim from every other
   process which is timestamped after our request.

#+begin_src python
    def can_claim_lock(self):
        first_req = self.get_request_queue()[0]
        if first_req.sender is self:
            acks = [sender for (sender, t) in self.latest_ack_from.iteritems()
                        if t > first_req.sent_at]
            return len(acks) == self.num_peers
#+end_src

Ordering events by their timestamp would produce a partial ordering,
but we need a total ordering. Thus, we break ties using an
alphabetical ordering based on the process' name. Note that this
requires that process names be unique.

#+begin_src python
    @classmethod
    def total_ordering(cls, msg):
        return (msg.sent_at, msg.sender.name)

    def get_request_queue(self):
        self.request_queue.sort(key=Process.total_ordering)
        return self.request_queue
#+end_src

Processes delegate the delivery of messages to the Message Broker.

#+begin_src python
    def send_message(self, recipient, msg):
        self.msg_broker.send_message(self, recipient, msg)
#+end_src

#+begin_src python :exports none
    def time(self):
        return self.clock.time
#+end_src

