posts/ReadAlong_TCOEDS.html
Each process is uniquely identified by a name. Processes coordinate
access to a shared resource via the<sub>lock</sub> and communicate via a
msg<sub>broker</sub>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">class</span> <span style="color: #e7c547;">Process</span><span style="color: #c397d8;">(</span><span style="color: #70c0b1;">object</span><span style="color: #c397d8;">)</span>:

    <span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">__init__</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>, name, the_lock, msg_broker<span style="color: #c397d8;">)</span>:
        <span style="color: #c397d8;">self</span>.name = name
        <span style="color: #c397d8;">self</span>.the_lock = the_lock
        <span style="color: #c397d8;">self</span>.msg_broker = msg_broker
</pre>
</div>

<p>
Every process maintains its own logical clock. Every claim on the lock
is stored in the request queue. Upon receiving a message from another
process, we record the current time and associate it with the sender
of the message in the <code>latest_ack_from</code> dict. We will refer to this dict
to determine whether another process has acknowledged our request to
claim the lock.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">self</span>.clock = LogicalClock<span style="color: #c397d8;">()</span>
<span style="color: #c397d8;">self</span>.request_queue = <span style="color: #c397d8;">[]</span>
<span style="color: #c397d8;">self</span>.latest_ack_from = <span style="color: #c397d8;">{}</span>
</pre>
</div>

<p>
To request the lock we send a timestamped message to each of our peers.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">request_lock</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>, peers<span style="color: #c397d8;">)</span>:
    <span style="color: #c397d8;">for</span> p <span style="color: #c397d8;">in</span> peers:
        <span style="color: #e78c45;">msg</span> = Message.a_mutex_request<span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>, p, <span style="color: #c397d8;">self</span>.time<span style="color: #7aa6da;">()</span><span style="color: #c397d8;">)</span>
        <span style="color: #c397d8;">self</span>.send_message<span style="color: #c397d8;">(</span>p, msg<span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
We also add the timestamped request to our own request queue. Then we
increment the clock. This clock tick corresponds to IR1, which
requires that the clock be incremented between successive events.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">self</span>.request_queue.append<span style="color: #c397d8;">(</span>Message.a_mutex_request<span style="color: #7aa6da;">(</span><span style="color: #c397d8;">self</span>, <span style="color: #c397d8;">self</span>, <span style="color: #c397d8;">self</span>.time<span style="color: #70c0b1;">()</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">self</span>.clock.increment<span style="color: #c397d8;">()</span>
</pre>
</div>

<p>
A process issues a request for the lock about once every 10 cycles of
our simulation provided that it has no requests pending. We can run
the simulation under different degrees of lock contention by adjusting
the probability that the process "wants" the lock.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">wants_lock</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>:
    <span style="color: #c397d8;">return</span> <span style="color: #c397d8;">not</span> <span style="color: #c397d8;">self</span>.has_request_pending<span style="color: #c397d8;">()</span> <span style="color: #c397d8;">and</span> randint<span style="color: #c397d8;">(</span>1, 10<span style="color: #c397d8;">)</span> == 1

<span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">has_request_pending</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>:
    <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">To see the effect of network congestion, uncomment the line below</span>
    <span style="color: #969896; font-style: italic;">#</span><span style="color: #969896; font-style: italic;">return False</span>
    <span style="color: #c397d8;">return</span> <span style="color: #70c0b1;">any</span><span style="color: #c397d8;">(</span>x <span style="color: #c397d8;">for</span> x <span style="color: #c397d8;">in</span> <span style="color: #c397d8;">self</span>.request_queue <span style="color: #c397d8;">if</span> x.sender <span style="color: #c397d8;">is</span> <span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
If a process owns the lock, its request is guaranteed to be at the
front of the queue. Thus, to release the lock we pop the head of the
queue and notify the other processes. Sending these messages
corresponds to an event, so we increment the clock in accordance with
IR1.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">release_lock</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>, peers<span style="color: #c397d8;">)</span>:
    <span style="color: #c397d8;">assert</span> <span style="color: #c397d8;">self</span>.the_lock.owner<span style="color: #c397d8;">()</span> <span style="color: #c397d8;">is</span> <span style="color: #c397d8;">self</span>, <span style="color: #b9ca4a;">"Tried to release a lock we don't own!"</span>
    <span style="color: #e78c45;">req</span> = <span style="color: #c397d8;">self</span>.request_queue.pop<span style="color: #c397d8;">(</span>0<span style="color: #c397d8;">)</span>
    <span style="color: #c397d8;">assert</span> req.sender <span style="color: #c397d8;">is</span> <span style="color: #c397d8;">self</span>, <span style="color: #b9ca4a;">"We somehow claimed the lock without being at the front of the queue!"</span>
    <span style="color: #c397d8;">self</span>.the_lock.release<span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>
    <span style="color: #c397d8;">for</span> p <span style="color: #c397d8;">in</span> peers:
        <span style="color: #c397d8;">self</span>.send_message<span style="color: #c397d8;">(</span>p, Message.a_mutex_release<span style="color: #7aa6da;">(</span><span style="color: #c397d8;">self</span>, p, <span style="color: #c397d8;">self</span>.time<span style="color: #70c0b1;">()</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
    <span style="color: #c397d8;">self</span>.clock.increment<span style="color: #c397d8;">()</span>
</pre>
</div>

<p>
We can adjust how long a process holds the lock here. Increasing the
expected lock hold time while holding constant the probability that a
process wants the lock will increase lock contention.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">ready_to_release</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>:
    <span style="color: #c397d8;">return</span> randint<span style="color: #c397d8;">(</span>1, 2<span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
According to IR2, when a process receives a message it sets its clock
to a value greater than or equal to its present value and greater than
timestamp on the incoming message.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">receive_message</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>, sender, msg<span style="color: #c397d8;">)</span>:
    <span style="color: #c397d8;">self</span>.clock.ensure_at_least<span style="color: #c397d8;">(</span>msg.sent_at + 1<span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
The first type of message we must handle is a request for the lock.
After we place the request on the request<sub>queue</sub>, we send a timestamped
acknowledgement to the process that claimed the lock.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">if</span> msg.content == <span style="color: #b9ca4a;">"REQUEST"</span>:
    <span style="color: #c397d8;">self</span>.request_queue.append<span style="color: #c397d8;">(</span>msg<span style="color: #c397d8;">)</span>
    <span style="color: #c397d8;">self</span>.send_message<span style="color: #c397d8;">(</span>sender, Message.an_ack<span style="color: #7aa6da;">(</span><span style="color: #c397d8;">self</span>, sender, <span style="color: #c397d8;">self</span>.time<span style="color: #70c0b1;">()</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
The second type of message is a release of the lock. The (now former)
owner of the lock is guaranteed to be at the head of the queue, so we
just pop the head of the queue.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">elif</span> msg.content == <span style="color: #b9ca4a;">"RELEASE"</span>:
    logging.debug<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"{} processing release by {}. Before removing:"</span>.<span style="color: #70c0b1;">format</span><span style="color: #7aa6da;">(</span><span style="color: #c397d8;">self</span>, sender<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
    logging.debug<span style="color: #c397d8;">(</span><span style="color: #70c0b1;">str</span><span style="color: #7aa6da;">(</span><span style="color: #c397d8;">self</span>.request_queue<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
    <span style="color: #c397d8;">self</span>.request_queue.pop<span style="color: #c397d8;">(</span>0<span style="color: #c397d8;">)</span>
    logging.debug<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"After: {}:"</span>.<span style="color: #70c0b1;">format</span><span style="color: #7aa6da;">(</span><span style="color: #c397d8;">self</span>.request_queue<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
The third and final type of message is an acknowledgement of our claim
from another process. In this case we simply record the time of the
acknowledgement and the process that sent it.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">elif</span> msg.content == <span style="color: #b9ca4a;">"ACK"</span>:
    <span style="color: #c397d8;">self</span>.latest_ack_from<span style="color: #c397d8;">[</span>sender.name<span style="color: #c397d8;">]</span> = msg.sent_at
</pre>
</div>

<p>
We could potentially claim the lock in response to two types of
events: an acknowledgement of our claim (if no other process owns the
lock) or a notification of a release. When we receive either of these
messages, we check whether we have the right to claim the lock. If we
do, we take it.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">if</span> msg.content <span style="color: #c397d8;">in</span> <span style="color: #c397d8;">[</span><span style="color: #b9ca4a;">"ACK"</span>, <span style="color: #b9ca4a;">"RELEASE"</span><span style="color: #c397d8;">]</span> <span style="color: #c397d8;">and</span> <span style="color: #c397d8;">self</span>.can_claim_lock<span style="color: #c397d8;">()</span>:
        <span style="color: #c397d8;">self</span>.the_lock.claim<span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
We can claim the lock if and only if the following two conditions
hold:
</p>

<ol class="org-ol">
<li>Our request for the lock is ordered before every other request.</li>
<li>We have received an acknowledgement of our claim from every other
process which is timestamped after our request.</li>
</ol>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">can_claim_lock</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>:
    <span style="color: #e78c45;">first_req</span> = <span style="color: #c397d8;">self</span>.get_request_queue<span style="color: #c397d8;">()[</span>0<span style="color: #c397d8;">]</span>
    <span style="color: #c397d8;">if</span> first_req.sender <span style="color: #c397d8;">is</span> <span style="color: #c397d8;">self</span>:
        <span style="color: #e78c45;">HARDCODED_NUM_PEERS</span> = 8 <span style="color: #969896; font-style: italic;"># </span><span style="color: #d54e53; font-weight: bold;">FIX</span><span style="color: #969896; font-style: italic;">ME: Stop hardcoding</span>
        <span style="color: #e78c45;">acks</span> = <span style="color: #c397d8;">[</span>sender <span style="color: #c397d8;">for</span> <span style="color: #7aa6da;">(</span>sender, t<span style="color: #7aa6da;">)</span> <span style="color: #c397d8;">in</span> <span style="color: #c397d8;">self</span>.latest_ack_from.iteritems<span style="color: #7aa6da;">()</span>
                    <span style="color: #c397d8;">if</span> t &gt; first_req.sent_at<span style="color: #c397d8;">]</span>
        <span style="color: #c397d8;">return</span> <span style="color: #70c0b1;">len</span><span style="color: #c397d8;">(</span>acks<span style="color: #c397d8;">)</span> == HARDCODED_NUM_PEERS
</pre>
</div>

<p>
Ordering events by their timestamp would produce a partial ordering,
but we need a total ordering. Thus, we break ties using an
alphabetical ordering based on the process' name. Note that this
requires that process names be unique.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">@classmethod</span>
<span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">total_ordering</span><span style="color: #c397d8;">(</span>cls, msg<span style="color: #c397d8;">)</span>:
    <span style="color: #c397d8;">return</span> <span style="color: #c397d8;">(</span>msg.sent_at, msg.sender.name<span style="color: #c397d8;">)</span>

<span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">get_request_queue</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span><span style="color: #c397d8;">)</span>:
    <span style="color: #c397d8;">self</span>.request_queue.sort<span style="color: #c397d8;">(</span>key=Process.total_ordering<span style="color: #c397d8;">)</span>
    <span style="color: #c397d8;">return</span> <span style="color: #c397d8;">self</span>.request_queue
</pre>
</div>

<p>
Processes delegate the delivery of messages to the Message Broker.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">def</span> <span style="color: #7aa6da;">send_message</span><span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>, recipient, msg<span style="color: #c397d8;">)</span>:
    <span style="color: #c397d8;">self</span>.msg_broker.send_message<span style="color: #c397d8;">(</span><span style="color: #c397d8;">self</span>, recipient, msg<span style="color: #c397d8;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c397d8;">if</span> <span style="color: #70c0b1;">__name__</span> == <span style="color: #b9ca4a;">"__main__"</span>:
