src/posts/ReadAlong_TCOEDS.org
** Driver

Our driver program is simple. We instantiate 10 processes, a lock, and
a message broker. In each time cycle, every process has the chance to
(randomly) request the lock. If the lock is owned, the owner randomly
releases the lock. The message broker then delivers pending messages.

When the program exits, we print some summary statistics to show how
many times the lock was claimed and released, as well as how many
messages were enqueued for delivery. A non-zero exit status indicates
that none of our assertions failed and our distributed algorithm
worked.

#+begin_src python :exports code
import argparse

if __name__ == "__main__":

    parser = argparse.ArgumentParser('Simulate Processes coordinating mutual exclusion.')
    parser.add_argument(
        '-v', '--verbose',
        help='print every message exchanged between processes',
        action='store_true')
    args = parser.parse_args()
    log_level = logging.DEBUG if args.verbose else logging.INFO
    logging.basicConfig(level=log_level)
#+end_src

#+begin_src python
    the_lock = Mutex()
    msg_broker = MsgBroker()

    num_processes = 10

    a = Process("Andromeda", the_lock, msg_broker, num_processes - 1)
    b = Process("Bonesaw", the_lock, msg_broker, num_processes - 1)
    c = Process("Charybda", the_lock, msg_broker, num_processes - 1)
    d = Process("Doofus", the_lock, msg_broker, num_processes - 1)
    e = Process("Egbertina", the_lock, msg_broker, num_processes - 1)
    f = Process("Fido", the_lock, msg_broker, num_processes - 1)
    g = Process("Gary", the_lock, msg_broker, num_processes - 1)
    h = Process("Hufflepuff", the_lock, msg_broker, num_processes - 1)
    i = Process("Iola", the_lock, msg_broker, num_processes - 1)
    j = Process("Jethro", the_lock, msg_broker, num_processes - 1)

    processes = [a, b, c, d, e, f, g, h, i, j]
    assert len(processes) == num_processes

    SIMULATION_NUM_CYCLES = 10000

    logging.info("Starting simulation with {} processes.".format(len(processes)))
    for t in range(1, SIMULATION_NUM_CYCLES):
        for p in processes:
            peers = [x for x in processes if not x is p]
            if p.wants_lock():
                p.request_lock(peers)
            if p == the_lock.owner() and p.ready_to_release():
                p.release_lock(peers)

        msg_broker.deliver()

    logging.info("The lock was claimed {} times and released {} times"
                 .format(the_lock.num_claims, the_lock.num_releases))
    logging.info("MsgBroker: {}".format(msg_broker))
#+END_SRC

#+RESULTS:

* Footnotes

[fn:1] Lest the Amazon corporate overlords who instituted high-density,
open-plan seating read this as a success story, I should point out
that said coworker was audibly singing AC/DC's "Highway to Hell" and
playing the air drums with No. 2 pencils just before joining our
conversation. Odd guy, true story.

* Appendix

** Proof that converse of Clock Condition does not hold
#+BEGIN_EXAMPLE
|     |
|     |
a2    |
|     b1
a1    |
|     |
A     B
#+END_EXAMPLE

To see why, consider the above scenario and assume that both the Clock
Condition and its converse are true.

That is for any events $a$ and $b$, we have the Clock Condition:

\begin{equation}
    \label{eq:clock-condition}
    \text{if } a \rightarrow b \text{ then } C \langle a \rangle < C \langle b \rangle \\
\end{equation}

And its converse:

\begin{equation}
    \label{eq:clock-condition-converse}
    \text{if } C \langle a \rangle < C \langle b \rangle \text{ then } a \rightarrow b
\end{equation}

$a_1$ and $a_2$ occur in the same process, so by the first rule of the
happened-before relation

\begin{equation}
    \label{eq:a1}
    a_1 \rightarrow a_2
\end{equation}

No messages are exchanged between processes $A$ and $B$, so by the
second and third rules of the happened-before relation

\begin{equation}
    \label{eq:a2}
    a_1 \nrightarrow b_1
\end{equation}

\begin{equation}
    \label{eq:a3}
    a_2 \nrightarrow b_1
\end{equation}

If $C \langle a_1 \rangle < C \langle b_1 \rangle$, then
\ref{eq:clock-condition-converse} implies that $a_1 \rightarrow b_1$,
which contradicts \ref{eq:a2}. Thus,

\begin{equation}
    \label{eq:a4}
    C \langle a_1 \rangle \ge C \langle b_1 \rangle
\end{equation}

If $C \langle a_1 \rangle > C \langle b_1 \rangle$, then
\ref{eq:clock-condition-converse} implies that $b_1 \rightarrow a_1$,
which also contradicts \ref{eq:a2}. Thus, by \ref{eq:a4}

\begin{equation}
    \label{eq:a5}
    C \langle a_1 \rangle = C \langle b_1 \rangle
\end{equation}

By a similar argument, we have that

\begin{equation}
    \label{eq:a6}
    C \langle a_2 \rangle = C \langle b_1 \rangle
\end{equation}

Combining \ref{eq:a5} and \ref{eq:a6}, we have that $C \langle a_1
\rangle = C \langle a_2 \rangle = C \langle b_1 \rangle$. But we have
in \ref{eq:a1} that $a_1 \rightarrow a_2$, so to satisfy
\ref{eq:clock-condition} requires that $C \langle a_1 \rangle < C
\langle a_2 \rangle$. This leads to a contradiction, so
\ref{eq:clock-condition-converse} does not hold.

