posts/ReadAlong_TCOEDS.html
    logging.basicConfig<span style="color: #c397d8;">(</span>level=logging.INFO<span style="color: #c397d8;">)</span>
    <span style="color: #e78c45;">the_lock</span> = Mutex<span style="color: #c397d8;">()</span>
    <span style="color: #e78c45;">msg_broker</span> = MsgBroker<span style="color: #c397d8;">()</span>

    <span style="color: #e78c45;">a</span> = Process<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"Andromeda"</span>, the_lock, msg_broker<span style="color: #c397d8;">)</span>
    <span style="color: #e78c45;">b</span> = Process<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"Bonesaw"</span>, the_lock, msg_broker<span style="color: #c397d8;">)</span>
    <span style="color: #e78c45;">c</span> = Process<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"Charybda"</span>, the_lock, msg_broker<span style="color: #c397d8;">)</span>
    <span style="color: #e78c45;">d</span> = Process<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"Doofus"</span>, the_lock, msg_broker<span style="color: #c397d8;">)</span>
    <span style="color: #e78c45;">e</span> = Process<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"Egbertina"</span>, the_lock, msg_broker<span style="color: #c397d8;">)</span>
    <span style="color: #e78c45;">f</span> = Process<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"Fido"</span>, the_lock, msg_broker<span style="color: #c397d8;">)</span>
    <span style="color: #e78c45;">g</span> = Process<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"Gary"</span>, the_lock, msg_broker<span style="color: #c397d8;">)</span>
    <span style="color: #e78c45;">h</span> = Process<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"Hufflepuff"</span>, the_lock, msg_broker<span style="color: #c397d8;">)</span>
    <span style="color: #e78c45;">i</span> = Process<span style="color: #c397d8;">(</span><span style="color: #b9ca4a;">"Iola"</span>, the_lock, msg_broker<span style="color: #c397d8;">)</span>

    <span style="color: #e78c45;">processes</span> = <span style="color: #c397d8;">[</span>a, b, c, d, e, f, g, h, i<span style="color: #c397d8;">]</span>
    <span style="color: #e78c45;">SIMULATION_DURATION</span> = 1000000

    <span style="color: #c397d8;">for</span> t <span style="color: #c397d8;">in</span> <span style="color: #70c0b1;">range</span><span style="color: #c397d8;">(</span>1, SIMULATION_DURATION<span style="color: #c397d8;">)</span>:
        <span style="color: #c397d8;">for</span> p <span style="color: #c397d8;">in</span> processes:
            <span style="color: #e78c45;">peers</span> = <span style="color: #c397d8;">[</span>x <span style="color: #c397d8;">for</span> x <span style="color: #c397d8;">in</span> processes <span style="color: #c397d8;">if</span> <span style="color: #c397d8;">not</span> x <span style="color: #c397d8;">is</span> p<span style="color: #c397d8;">]</span>
            <span style="color: #c397d8;">if</span> p.wants_lock<span style="color: #c397d8;">()</span>:
                p.request_lock<span style="color: #c397d8;">(</span>peers<span style="color: #c397d8;">)</span>
            <span style="color: #c397d8;">if</span> p == the_lock.owner<span style="color: #c397d8;">()</span> <span style="color: #c397d8;">and</span> p.ready_to_release<span style="color: #c397d8;">()</span>:
                p.release_lock<span style="color: #c397d8;">(</span>peers<span style="color: #c397d8;">)</span>

        msg_broker.deliver<span style="color: #c397d8;">()</span>

    <span style="color: #c397d8;">print</span> <span style="color: #b9ca4a;">"The lock was claimed {} times and released {} times"</span>.<span style="color: #70c0b1;">format</span><span style="color: #c397d8;">(</span>the_lock.num_claims, the_lock.num_releases<span style="color: #c397d8;">)</span>
    <span style="color: #c397d8;">print</span> <span style="color: #b9ca4a;">"MsgBroker: {}"</span>.<span style="color: #70c0b1;">format</span><span style="color: #c397d8;">(</span>msg_broker<span style="color: #c397d8;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org768abf4" class="outline-3">
<h3 id="org768abf4"><span class="section-number-3">1.4</span> Appendix</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-org2f3d0f3" class="outline-4">
<h4 id="org2f3d0f3"><span class="section-number-4">1.4.1</span> Proof that converse of Clock Condition does not hold</h4>
<div class="outline-text-4" id="text-1-4-1">
<pre class="example">
|     |
|     |
a2    |
|     b1
a1    |
|     |
A     B
</pre>

<p>
To see why, consider the above scenario and assume that both the Clock
Condition and its converse are true.
</p>

<p>
That is for any events \(a\) and \(b\)
</p>

<p>
\[
\text{if } a \rightarrow b \text{ then } C \langle a \rangle < C \langle b \rangle.
\text{if } C \langle a \rangle < C \langle b \rangle \text{ then } a \rightarrow b
\]
</p>

<p>
\(a_1\) and \(a_2\) occur in the same process, so by the first rule of the
happened-before relation
</p>

<p>
(1) \(a_1 \rightarrow a_2\)
</p>

<p>
No messages are exchanged between processes \(A\) and \(B\), so by the
second and third rules of the happened-before relation
</p>

<p>
(2) \(a_1 \nrightarrow b_1\)
</p>

<p>
(3) \(a_2 \nrightarrow b_1\)
</p>

<p>
If \(C \langle a_1 \rangle < C \langle b_1 \rangle\), then the converse
of the Clock Condition implies that \(a_1 \rightarrow b_1\), which contradicts
(2). Thus,
</p>

<p>
(4) \(C \langle a_1 \rangle \ge C \langle b_1 \rangle\)
</p>

<p>
If \(C \langle a_1 \rangle > C \langle b_1 \rangle\), then \(b_1
\rightarrow a_1\), which also contradicts (2). Thus, by (4)
</p>

<p>
(5) \(C \langle a_1 \rangle = C \langle b_1 \rangle\)
</p>

<p>
By a similar argument, we have that
</p>

<p>
(6) \(C \langle a_2 \rangle = C \langle b_1 \rangle\)
</p>

<p>
Combining (5) and (6), we have that \(C \langle a_1 \rangle = C \langle
a_2 \rangle = C \langle b_1 \rangle\). But we have in (1) that \(a_1
\rightarrow a_2\), so to satisfy the Clock Condition requires that \(C
\langle a_1 \rangle < C \langle a_2 \rangle\). This leads to a
contradiction, so the converse of the Clock Condition does not hold.
</p>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Lest the Amazon corporate overlords who instituted high-density,
open-plan seating read this as a success story, I should point out
that said coworker was audibly singing AC/DC's "Highway to Hell" and
playing the air drums with No. 2 pencils just before joining our
conversation. Odd guy, true story.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Andrew Stahlman</p>
<p class="date">Created: 2017-01-22 Sun 21:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
